app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'rubyists' LIMIT 1
---
	def show
		@category = Category.find_by slug: params[:id]

INSERT INTO "categories" ("created_at", "name", "slug", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 23 May 2014 14:56:09 EDT -04:00], ["name", "rubyists"], ["slug", "rubyists-2"], ["updated_at", Fri, 23 May 2014 14:56:09 EDT -04:00]]
---
	def create
		@category = Category.new(category_params)

		if @category.save