app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'some-lame-title' LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "what a lame post!"], ["created_at", Mon, 21 Apr 2014 22:37:59 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 21 Apr 2014 22:37:59 UTC +00:00], ["user_id", 1]]
---
	def create
		@post = Post.find_by slug: params[:post_id]
		@comment = @post.comments.build(params.require(:comment).permit(:body))
		@comment.creator = current_user
		if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "5"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 14 May 2014 17:55:00 UTC +00:00], ["updated_at", Wed, 14 May 2014 17:55:00 UTC +00:00], ["user_id", 5], ["vote", true], ["voteable_id", 5], ["voteable_type", "Comment"]]
---
	def vote
		@comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])