app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse

INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Wed, 16 Apr 2014 22:12:41 UTC +00:00], ["title", "new title!"], ["updated_at", Wed, 16 Apr 2014 22:12:41 UTC +00:00], ["url", "www.ebay.com"]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save

UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["title", "stuffs"], ["description", "more and more and more."], ["updated_at", Mon, 05 May 2014 21:46:34 UTC +00:00]]
---
  def update

    if @post.update(post_params)

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 13 May 2014 19:15:18 UTC +00:00], ["updated_at", Tue, 13 May 2014 19:15:18 UTC +00:00], ["user_id", 5], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'some-lame-title' LIMIT 1
---
  def set_post
    @post = Post.find_by slug: params[:id]