app/controllers/posts_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    @post = Post.new(post_params)
    @post.creator = User.first #change once we have authentication

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 2]]
---
  def set_post
    @post = Post.find(params[:id])