app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'Jessie' ORDER BY "users"."id" ASC LIMIT 1
---
	def create
		user = User.where(username: params[:username]).first